Tekla.Structures.Analysis.AnalysisBar.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisBar class.

Tekla.Structures.Analysis.AnalysisBar.AnalysisType
Gets or sets the analysis type of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.CardinalPoint
Gets or sets the cardinal point of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Material
Gets or sets the material of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.ProfileStart
Gets or sets the start profile of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.ProfileEnd
Gets or sets the end profile of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Curvature
Gets or sets the curvature of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Composite
Gets or sets the composite beam of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.AnalysisDesignCode
Gets or sets the analysis design code of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Label
Gets or sets the label of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Positions
Gets the positions of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Members
Gets the members of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Select
Selects an analysis bar.
The AnalysisModelName and ID have to be set.

Tekla.Structures.Analysis.AnalysisBar.Modify
Modifies an analysis bar.
The method is not implemented.

Tekla.Structures.Analysis.AnalysisBar.Delete
Deletes an analysis bar.
The method is not implemented.

Tekla.Structures.Analysis.AnalysisBar.Add(Tekla.Structures.Analysis.AnalysisPosition,Tekla.Structures.Analysis.AnalysisMember)
Adds a position and member to the analysis bar.
position: The position to be added.
member: The member to be added.

Tekla.Structures.Analysis.AnalysisBar.AddAnalysisPosition(Tekla.Structures.Analysis.AnalysisPosition,Tekla.Structures.Analysis.AnalysisMember)
Adds position to analysis bar.
Also adds member if not first position.